app/controllers/dashboard_controller.rb

  def create_order
    products = current_user.products.all
    order = current_user.order_transactions

    order_arrays = []
    product_price = []

    product_names = params.keys
    product_names.slice!(product_names.length-3,3)
    product_names.slice!(0,1)

    product_names.each do |x|
        product_name = x
        quantity = params[x].to_i
        price = products.find_by(product_name:x).price

        order_details = {}
        order_details[:product_name] = product_name
        order_details[:quantity] = quantity
        order_details[:price] = price

        product_price.push(quantity * price)

        order_arrays.push(order_details)
---
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND (authenticity_token) LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
SELECT "order_transactions".* FROM "order_transactions" WHERE "order_transactions"."user_id" = $1 ORDER BY "order_transactions"."id" DESC LIMIT $2  [["user_id", 7], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."product_name" = $2 LIMIT $3  [["user_id", 6], ["product_name", "bread"], ["LIMIT", 1]]
INSERT INTO "shop_details" ("shop_name", "shop_location", "business_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["shop_name", nil], ["shop_location", "manila\n"], ["business_type", nil], ["created_at", "2022-09-22 09:03:50.423034"], ["updated_at", "2022-09-22 09:03:50.423034"]]
UPDATE "shop_details" SET "business_type" = $1, "updated_at" = $2 WHERE "shop_details"."id" = $3  [["business_type", "cafe"], ["updated_at", "2022-09-22 09:21:57.819360"], ["id", 9]]

      quantity = params[x].to_i
      price = products.find_by(product_name:x).price

      product_sales = current_user.order_transactions.last.product_sales
      product_sales.create(product_name:product_name,quantity:quantity,price:price,total_price: price*quantity)
---
SELECT "order_transactions".* FROM "order_transactions" WHERE "order_transactions"."user_id" = $1 ORDER BY "order_transactions"."id" DESC LIMIT $2  [["user_id", 7], ["LIMIT", 1]]
INSERT INTO "order_transactions" ("orders", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"
INSERT INTO "product_sales" ("product_name", "price", "quantity", "created_at", "updated_at", "total_price", "order_transaction_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def order_receipt
    @Shop = current_user.shop_details.first
    @Order = current_user.order_transactions.find(params[:id])
    @Orders = current_user.order_transactions.find(params[:id]).orders
---
SELECT "shop_details".* FROM "shop_details" WHERE "shop_details"."user_id" = $1 ORDER BY "shop_details"."id" ASC LIMIT $2  [["user_id", 7], ["LIMIT", 1]]
SELECT "order_transactions".* FROM "order_transactions" WHERE "order_transactions"."user_id" = $1 AND "order_transactions"."id" = $2 LIMIT $3  [["user_id", 7], ["id", 68], ["LIMIT", 1]]
SELECT "order_transactions".* FROM "order_transactions" WHERE "order_transactions"."user_id" = $1 AND "order_transactions"."id" = $2 LIMIT $3  [["user_id", 7], ["id", 72], ["LIMIT", 1]]

  def checkout
    @Products = current_user.products.all
    params_names = params.keys
    params_values = params.values
    params_values.slice!(params_values.length-3,3)
    @Checkout = []
    @Price_array = []
    @Price_product = []
    params_values.each_with_index do |quantity,idx|
      if quantity != ""
        @Checkout.push({params_names[idx]=>quantity})
        @Price_array.push(@Products.find_by(product_name:params_names[idx]).price)
        product = @Products.find_by(product_name:params_names[idx]).price * quantity.to_i
---
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND (qwe) LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."product_name" = $2 LIMIT $3  [["user_id", 7], ["product_name", "qwe"], ["LIMIT", 1]]

  def all_orders
    @Orders = current_user.order_transactions.pluck(:orders, :created_at, :id)
---
SELECT "order_transactions"."orders", "order_transactions"."created_at", "order_transactions"."id" FROM "order_transactions" WHERE "order_transactions"."user_id" = $1  [["user_id", 7]]

  def sold_products
    @Product_Report = []

    all_products = current_user.products.all.pluck(:product_name)

    all_products.each do |name|
      product_quantity = current_user.product_sales.where(product_name: name).pluck(:quantity)
      total_price = current_user.product_sales.where(product_name: name).pluck(:total_price)

      product_name = name
      price = current_user.products.find_by(product_name:name).price
---
SELECT "products"."product_name" FROM "products" WHERE "products"."user_id" = $1  [["user_id", 7]]
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."product_name" = $2 LIMIT $3  [["user_id", 7], ["product_name", "coffee"], ["LIMIT", 1]]
SELECT "product_sales"."quantity" FROM "product_sales" WHERE "product_sales"."user_id" = $1 AND "product_sales"."product_name" = $2  [["user_id", 7], ["product_name", "coffee"]]
SELECT "product_sales"."total_price" FROM "product_sales" WHERE "product_sales"."user_id" = $1 AND "product_sales"."product_name" = $2  [["user_id", 7], ["product_name", "coffee"]]
SELECT "product_sales".* FROM "product_sales" WHERE "product_sales"."user_id" = $1 AND "product_sales"."product_name" = $2 LIMIT $3  [["user_id", 7], ["product_name", "coffee"], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."product_name" = $2 LIMIT $3  [["user_id", 7], ["product_name", "qwe"], ["LIMIT", 1]]

  def delete_order
    current_user.order_transactions.find(params[:id]).destroy

    respond_to do |format|
      format.html { redirect_to all_orders_path, notice: "Order was successfully destroyed." }
      format.json { head :no_content }
    end

    current_user.product_sales.where(order_transaction_id: params[:id]).destroy_all
---
DELETE FROM "order_transactions" WHERE "order_transactions"."id" = $1  [["id", 63]]
SELECT "order_transactions".* FROM "order_transactions" WHERE "order_transactions"."user_id" = $1 AND "order_transactions"."id" = $2 LIMIT $3  [["user_id", 7], ["id", 63], ["LIMIT", 1]]
DELETE FROM "order_transactions" WHERE "order_transactions"."id" = $1  [["id", 67]]