app/controllers/dashboard_controller.rb

  def create_order
    products = current_user.products.all
    order = current_user.order_transactions

    order_arrays = []

    product_names = params.keys
    product_names.slice!(product_names.length-3,3)
    product_names.slice!(0,1)

    product_names.each do |x|

      if x == 'total_price'
        order_arrays.push({:total_price => sprintf('%.2f',params[x])})
      else
        order_details = {}
        order_details[:product_name] = x
        order_details[:quantity] = params[x].to_i
        order_details[:price] = products.find_by(product_name:x).price

        order_arrays.push(order_details)
      end

    end

    if order.create(orders: order_arrays)
---
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND (qwerqewr) LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."product_name" = $2 LIMIT $3  [["user_id", 3], ["product_name", "qwe"], ["LIMIT", 1]]
INSERT INTO "order_transactions" ("orders", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"

  def order_receipt
    @Shop = current_user.shop_details.first
---
SELECT "shop_details".* FROM "shop_details" WHERE "shop_details"."user_id" = $1 ORDER BY "shop_details"."id" ASC LIMIT $2  [["user_id", 3], ["LIMIT", 1]]

  def checkout
    @Products = current_user.products.all
    params_names = params.keys
    params_values = params.values
    params_values.slice!(params_values.length-3,3)
    @Checkout = []
    @Price_array = []
    @Price_product = []
    params_values.each_with_index do |quantity,idx|
      if quantity != ""
        @Checkout.push({params_names[idx]=>quantity})
        @Price_array.push(@Products.find_by(product_name:params_names[idx]).price)
---
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."product_name" = $2 LIMIT $3  [["user_id", 4], ["product_name", "qwerqewr"], ["LIMIT", 1]]