app/controllers/product_details_controller.rb

SELECT "product_details".* FROM "product_details"
---
  def index
    @product_details = ProductDetail.all

INSERT INTO "product_details" ("product_name", "price", "image", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["product_name", "qwer"], ["price", 1.0], ["image", nil], ["created_at", "2022-09-23 11:21:48.800922"], ["updated_at", "2022-09-23 11:21:48.800922"], ["user_id", 5]]
---
  def create
    @product_detail = current_user.product_details.build(product_detail_params)

    respond_to do |format|
      if @product_detail.save

DELETE FROM "product_details" WHERE "product_details"."id" = $1  [["id", 6]]
---
  def destroy
    @product_detail.destroy

SELECT "product_details".* FROM "product_details" WHERE "product_details"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_product_detail
      @product_detail = ProductDetail.find(params[:id])