app/controllers/products_controller.rb

  def index
    @products = current_user.products.all
---
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1  [["user_id", 3]]

  def create
    @product = current_user.products.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("product_name", "price", "image", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["product_name", "qwer"], ["price", 1234.0], ["image", nil], ["created_at", "2022-09-23 13:11:47.054104"], ["updated_at", "2022-09-23 13:11:47.054104"], ["user_id", 3]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "product_name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["product_name", "qwer2344"], ["updated_at", "2022-09-23 13:11:57.728480"], ["id", 1]]

  def destroy
    @product.destroy
---
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 8]]

    def set_product
      @product = current_user.products.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]