app/controllers/shop_details_controller.rb

SELECT COUNT(*) FROM "shop_details" WHERE "shop_details"."user_id" = $1  [["user_id", 6]]
---
    def shop_name
        if current_user.shop_details.count != 0

INSERT INTO "shop_details" ("shop_name", "shop_location", "business_type", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create_details

      case params[:detail]
        when "shop_name"
          if params[:shop_name].count("a-zA-Z") > 0
            redirect_to shop_location_path({name:params[:shop_name]})
          else
            respond_to do |format|
              format.html { redirect_to shop_name_path, notice: "Field is blank!" }
            end
          end
        when "shop_location"
          if params[:shop_location].count("a-zA-Z") > 0
            redirect_to shop_number_path({location:params[:shop_location],name:params[:name]})
          else
            respond_to do |format|
              format.html { redirect_to shop_location_path({name:params[:name]}), notice: "Field is blank!" }
            end
          end
        when "shop_number"
          if params[:shop_number] !~ /\D/
            current_user.shop_details.create(shop_name:params[:name],shop_location:params[:location],shop_number: params[:shop_number].to_s)