app/controllers/shop_details_controller.rb

    def shop
        if current_user.shop_details.count != 0
---
SELECT COUNT(*) FROM "shop_details" WHERE "shop_details"."user_id" = $1  [["user_id", 506]]